{
    "Genre": {
        "Action": "Films about explosive stakes, fast decisions, and people who solve problems by running toward danger instead of away from it, usually with grit, quick reflexes, and just enough swagger to survive the chaos.",
        "Adventure": "Stories of daring journeys, unknown places, and brave souls who leave home knowing things will absolutely go wrong, but go anyway for treasure, truth, or the thrill of discovery.",
        "Animation": "Films about boundless imagination, expressive worlds, and characters who prove drawings can hit just as hard as live action, blending color, creativity, and emotion without limits.",
        "Comedy": "Stories of human absurdity, bad timing, and misunderstandings where laughter matters more than dignity, and awkward moments somehow turn into unforgettable punchlines.",
        "Crime": "Films about lawbreakers, law enforcers, and the very thin, very blurry line between them, where ambition, loyalty, and temptation collide in high-stakes choices.",
        "Drama": "Stories of emotional stakes, personal conflict, and quiet moments that somehow hit harder than explosions, leaning into relationships, consequences, and raw human truth.",
        "Family": "Films about togetherness, life lessons, and adventures meant to entertain kids while gently reassuring adults, mixing heart, humor, and a little wholesome chaos.",
        "Fantasy": "Stories of magic, myth, and impossible worlds where destiny is real and rules are mostly negotiable, inviting audiences to believe in wonder and enchantment again.",
        "History": "Films about real events and larger-than-life figures, shaped by time, memory, and dramatic interpretation, bringing the past to life with perspective and personality.",
        "Horror": "Stories of fear, dread, and things that absolutely should not be happening, but very much are, designed to unsettle, surprise, and linger long after the lights come back on.",
        "Music": "Films about rhythm, passion, and characters driven by sound, performance, and creative obsession, where every note pushes the story forward with emotional intensity.",
        "Mystery": "Stories of unanswered questions, hidden motives, and clues that only make sense at the very end, rewarding patience and sharp eyes with carefully constructed puzzles.",
        "Romance": "Films about love, longing, and emotional risk, where connection is the ultimate reward or heartbreak, and vulnerability is the real leap of faith required for intimacy.",
        "Science Fiction": "Stories of imagined futures, advanced technology, and big questions about humanity wrapped in spectacle, exploring what could be and what it might cost.",
        "Thriller": "Films about tension, danger, and escalating stakes where every decision feels one step from disaster, keeping nerves tight from start to finish with unrelenting suspense.",
        "War": "Stories of conflict, sacrifice, and survival, focusing on the human cost behind large-scale battles, where courage and loss often share the same moment.",
        "Western": "Films about frontier justice, dusty towns, stubborn sheriffs, and dramatic silence where justice rides a horse, and showdowns are settled under open skies."
    },
    "Decade": {
        "1920s": "Films from the silent era, where stories were told through expressive faces, bold visuals, and title cards that did a lot of heavy lifting, turning limitation into artistry with creativity and pure cinematic invention.",
        "1930s": "Stories shaped by hardship and escape, balancing elegance, optimism, and spectacle during uncertain times, offering audiences glamour and resilience when the real world felt anything but steady.",
        "1940s": "Films marked by shadow, moral tension, and resilience, reflecting a world at war and its aftermath, where noir tones and emotional gravity mirrored global uncertainty.",
        "1950s": "Stories of postwar confidence and anxiety, mixing polished style with growing cultural and emotional complexity, as glossy surfaces hid deeper questions about identity and change.",
        "1960s": "Films of change and experimentation, breaking old rules and questioning authority, identity, and tradition, embracing bold voices and new cinematic freedoms with revolutionary energy.",
        "1970s": "Stories driven by realism, rebellion, and flawed characters, capturing a grittier and more introspective era that favored moral ambiguity over neat endings with unflinching honesty.",
        "1980s": "Films about bold ideas, big emotions, and even bigger spectacle, where ambition was loud and sincerity was cool, blending blockbuster energy with unforgettable pop culture moments.",
        "1990s": "Stories balancing innovation and irony, blending mainstream appeal with a growing independent spirit, as fresh perspectives reshaped familiar genres and challenged conventional narratives.",
        "2000s": "Films shaped by technological leaps and global storytelling, expanding scale while redefining genres, as digital tools transformed how worlds were built on screen with new possibilities.",
        "2010s": "Stories influenced by franchise culture, social awareness, and personal storytelling existing side by side, where spectacle and intimate voices shared the spotlight in diverse narratives.",
        "2020s": "Films reflecting rapid change, streaming dominance, and a world rethinking how stories are made and shared, adapting quickly to shifting audiences and new platforms."
    },
    "Duration": {
        "Short": "Brief films that deliver an idea, moment, or punchline without overstaying their welcome, proving that a tight runtime can still leave a lasting impression.",
        "Standard": "Films with a familiar runtime that balance story, pacing, and audience attention, offering a complete experience without asking for an entire day or demanding extended commitment.",
        "Long": "Stories that take their time, letting characters, themes, and moments breathe, rewarding patience with deeper immersion, richer detail, and fuller character development.",
        "Epic": "Sweeping films with grand scope and extended runtimes, designed to feel like an event rather than a sitting, where scale and ambition stretch well beyond the ordinary."
    },
    "Country": {
        "Australia": "Films known for their relaxed confidence, striking landscapes, and a balance of grit, humor, and emotional honesty, often blending rugged settings with grounded, character-driven storytelling.",
        "Canada": "Stories often shaped by quiet intensity, genre experimentation, and a strong independent sensibility, frequently exploring identity and isolation with subtle emotional weight.",
        "France": "Films that value style, conversation, and emotional nuance, often embracing ambiguity over easy answers, favoring mood and character over tidy conclusions.",
        "Germany": "Stories marked by precision, introspection, and a willingness to confront history and identity head-on, combining disciplined craft with thoughtful thematic depth.",
        "Hong Kong": "Films defined by kinetic energy, expressive style, and a deep connection to genre innovation, blending action, crime, and drama with bold cinematic flair.",
        "India": "Stories rich in emotion, music, and spectacle, blending tradition, romance, and drama on a grand scale, where feeling and performance often take center stage.",
        "Ireland": "Films shaped by storytelling tradition, wit, and emotional depth, often rooted in history and identity, mixing humor with heartfelt reflection and cultural memory.",
        "Italy": "Stories blending passion, social realism, and visual elegance, with a strong sense of place and character, often capturing everyday life with warmth and style.",
        "Japan": "Films balancing tradition and modernity, known for their precision, atmosphere, and emotional restraint, often revealing depth through quiet moments.",
        "New Zealand": "Stories shaped by striking landscapes, mythic scale, and a strong sense of creative ambition, pairing intimate character work with expansive settings.",
        "South Korea": "Films celebrated for bold storytelling, tonal shifts, and sharp social observation, confidently mixing genres while tackling complex themes with innovative energy.",
        "Spain": "Stories marked by emotional intensity, visual flair, and an openness toward passion and contradiction, often embracing drama with vibrant energy and bold expression.",
        "Sweden": "Films known for introspection, restraint, and thoughtful exploration of human relationships, favoring atmosphere and psychological depth with meditative pacing.",
        "UK": "Stories balancing sharp wit, realism, and strong performances across class, history, and genre, often blending dry humor with social insight and narrative precision.",
        "USA": "Films spanning every genre and scale, driven by spectacle, storytelling ambition, and cultural influence, shaping global cinema with variety and reach."
    },
    "Theme": {
        "Abduction": "Stories centered on sudden loss of control, fear, and the desperate need to escape the unknown, where ordinary lives are upended in moments of terrifying uncertainty.",
        "Action": "Fast-paced tales driven by momentum, danger, and characters forced to act now and think later, fueled by urgency and split-second decisions.",
        "Addiction": "Stories exploring obsession, dependency, and the struggle between desire and self-control, revealing how craving can reshape identity and relationships.",
        "Adventure": "Journeys into the unknown where curiosity, courage, and bad decisions fuel the story, pushing characters beyond comfort and into discovery.",
        "Aging": "Reflections on time, memory, and the changing meaning of identity as life moves forward, capturing both loss and unexpected wisdom.",
        "Ambition": "Stories about desire pushing people upward, forward, or straight into trouble, as aspiration blurs the line between drive and obsession.",
        "Animation": "Themes expressed through imaginative worlds where emotion often matters more than realism, allowing creativity to amplify feeling and meaning.",
        "Betrayal": "Stories of broken trust, personal fallout, and consequences that linger long after the act, reshaping relationships in lasting ways.",
        "Biography": "Narratives drawn from real lives, shaped by achievement, failure, and human complexity, interpreting history through personal experience.",
        "Boxing": "Stories of discipline, endurance, and personal battles fought inside and outside the ring, where resilience defines victory or defeat.",
        "Chaos": "Films where order collapses and characters must adapt or be consumed by uncertainty, testing resilience under pressure.",
        "Childhood": "Stories shaped by innocence, discovery, and experiences that leave lasting marks, capturing formative moments both joyful and painful.",
        "Colonialism": "Explorations of power, exploitation, and cultural conflict rooted in historical dominance, examining lasting social and personal impact.",
        "Coming of Age": "Stories about growth, self-discovery, and the awkward transition into adulthood, where mistakes become lessons.",
        "Community": "Narratives focused on shared identity, collective struggle, and human connection, highlighting strength found in togetherness.",
        "Corruption": "Stories revealing moral decay as power, money, or influence override integrity, exposing the cost of compromised values.",
        "Courtroom": "Dramas built around truth, justice, and persuasion under intense scrutiny, where arguments can change lives.",
        "Crime": "Stories centered on lawbreaking, investigation, and the consequences of crossing lines, exploring motive and accountability.",
        "Darkness": "Explorations of fear, despair, and the unsettling sides of human nature, delving into shadows both literal and psychological.",
        "Deception": "Stories driven by lies, hidden motives, and carefully constructed illusions, where truth is layered and trust is always a fragile gamble.",
        "Dystopia": "Imagined futures where society has gone wrong and survival comes at a cost, revealing uncomfortable truths through extreme circumstances.",
        "Empire": "Stories about expansion, dominance, and the rise and fall of great powers, tracing ambition from triumph to inevitable decline.",
        "Escape": "Narratives fueled by the urgent need for freedom from physical or emotional confinement, where every step toward liberty carries risk.",
        "Existentialism": "Stories questioning meaning, purpose, and individual responsibility in an indifferent world, often embracing ambiguity over certainty.",
        "Exploitation": "Examinations of abuse, imbalance, and systems built on taking advantage of others, exposing uncomfortable structures of power.",
        "Faith": "Stories exploring belief, doubt, and the search for spiritual meaning, navigating conviction alongside uncertainty.",
        "Family": "Narratives built around bonds that comfort, complicate, and occasionally suffocate, revealing love in all its messy forms.",
        "Fantasy": "Stories set in imagined worlds where magic reshapes reality and destiny matters, inviting wonder alongside danger.",
        "Feel Good": "Uplifting stories designed to reassure, comfort, and leave audiences smiling, even if a few tears come first.",
        "Freedom": "Narratives centered on liberation, autonomy, and breaking away from control, celebrating self-determination.",
        "Friendship": "Stories celebrating loyalty, shared experience, and chosen family, where connection becomes a saving grace.",
        "Genius": "Explorations of brilliance, creativity, and the cost of exceptional minds, balancing admiration with isolation.",
        "Good vs Evil": "Stories structured around moral opposition and clear ethical stakes, highlighting choices that define character.",
        "Greed": "Narratives about desire for more and the damage it causes, tracing ambition as it tips into excess.",
        "Grief": "Stories about loss, mourning, and the long road toward healing, honoring the weight of absence.",
        "Heroism": "Tales of courage, sacrifice, and standing up when it matters most, where bravery often carries consequence.",
        "History": "Stories rooted in real events, shaped by memory and interpretation, revisiting the past through a modern lens.",
        "Horror": "Narratives designed to unsettle, disturb, and confront fear directly, turning anxiety into atmosphere.",
        "Honor": "Stories about personal codes, duty, and the price of integrity, where principles are tested under pressure.",
        "Honour": "Explorations of reputation, loyalty, and cultural values tied to identity, examining pride and responsibility.",
        "Hope": "Stories centered on optimism, resilience, and belief in better outcomes, even in the face of hardship.",
        "Human vs Machine": "Narratives questioning technology, autonomy, and what makes us human, exploring tension between progress and conscience.",
        "Humanity": "Stories examining compassion, cruelty, and shared human experience, revealing both flaws and grace.",
        "Identity": "Explorations of self, belonging, and personal transformation, where discovery reshapes perspective.",
        "Illusion": "Stories where perception blurs reality and truth is uncertain, inviting audiences to question what they see.",
        "Infidelity": "Narratives about trust, desire, and emotional fallout, tracing fragile relationships under strain.",
        "Journalism": "Stories focused on truth-seeking, ethics, and the power of information, highlighting responsibility and risk.",
        "Justice": "Narratives centered on fairness, accountability, and moral balance, asking who decides what is right.",
        "Loneliness": "Stories about isolation, longing, and the need for connection, tracing quiet moments where absence feels louder than any crowd.",
        "Loss": "Explorations of absence and how people adapt to what's gone, revealing grief as both weight and catalyst for change.",
        "Love": "Stories about emotional connection, vulnerability, and commitment, capturing the risks and rewards of opening one's heart.",
        "Loyalty": "Narratives examining devotion, allegiance, and personal sacrifice, where bonds are tested by pressure and choice.",
        "Mental Illness": "Stories portraying psychological struggle with empathy and realism, emphasizing humanity beyond diagnosis.",
        "Memory": "Explorations of remembrance, identity, and unreliable perception, where the past shapes truth in unexpected ways.",
        "Mentorship": "Stories about guidance, influence, and generational learning, showing how wisdom is passed and reshaped.",
        "Monster": "Narratives using creatures to explore fear, difference, and humanity, often revealing that the real threat feels closer to home.",
        "Morality": "Stories questioning right and wrong in complex situations, challenging easy answers and clear judgment.",
        "Mortality": "Reflections on death, impermanence, and the value of life, urging characters to confront what truly matters.",
        "Murder": "Stories driven by crime, investigation, and moral consequence, where motives unravel alongside truth.",
        "Music": "Narratives shaped by rhythm, creativity, and emotional expression, letting sound guide both story and soul.",
        "Nazi": "Stories addressing fascism, ideology, and historical trauma, confronting extremism and its lasting human cost.",
        "Obsession": "Narratives about fixation overtaking reason and balance, tracing ambition as it narrows into tunnel vision.",
        "Patriotism": "Stories exploring loyalty to nation and its moral limits, weighing pride against conscience and testing national ideals.",
        "Police": "Narratives centered on law enforcement, authority, and accountability, examining duty under scrutiny.",
        "Politics": "Stories examining power, ideology, and governance, revealing the personal stakes behind public decisions.",
        "Poverty": "Explorations of hardship, inequality, and survival, highlighting resilience amid systemic challenge.",
        "Power": "Narratives about control, influence, and responsibility, showing how authority shapes character.",
        "Prejudice": "Stories confronting bias, discrimination, and social injustice, exposing harm while seeking understanding.",
        "Prison": "Narratives exploring confinement, reform, and identity under pressure, where walls test resilience.",
        "Reality": "Stories grounded in authenticity and everyday human experience, finding meaning in the ordinary.",
        "Rebellion": "Narratives driven by resistance, defiance, and social change, fueled by refusal to accept the status quo.",
        "Redemption": "Stories about atonement, growth, and second chances, where mistakes become turning points and paths to transformation.",
        "Reform": "Narratives centered on change within flawed systems, pursuing improvement against resistance and entrenched institutional power.",
        "Retribution": "Stories driven by punishment and moral reckoning, balancing consequence with justice while exploring the price of vengeance.",
        "Revenge": "Narratives fueled by anger, justice, and personal vengeance, where retaliation blurs moral lines.",
        "Rivalry": "Stories about competition, pride, and personal conflict, where ambition sharpens both skill and tension.",
        "Sacrifice": "Narratives about giving up something meaningful for a greater cause, where personal loss becomes the price of loyalty, love, or belief.",
        "Satire": "Stories using humor and exaggeration to critique society, exposing flaws through wit, irony, and sharp observation.",
        "Science": "Narratives exploring discovery, experimentation, and consequence, where curiosity pushes boundaries and tests responsibility.",
        "Showbiz": "Stories about fame, performance, and life behind the spotlight, revealing ambition, illusion, and vulnerability beneath applause.",
        "Slavery": "Narratives confronting oppression, dehumanization, and resistance, honoring resilience in the face of systemic cruelty.",
        "Small Town": "Stories shaped by close communities, secrets, and tradition, where familiarity breeds both comfort and tension.",
        "Social Class": "Explorations of inequality, privilege, and mobility, tracing how status shapes opportunity and identity.",
        "Social Justice": "Stories advocating fairness, equity, and systemic change, highlighting voices challenging entrenched imbalance.",
        "Society": "Narratives examining collective behavior and social norms, questioning what is accepted and why.",
        "Space": "Stories set beyond Earth, exploring isolation and discovery, where vastness magnifies both wonder and vulnerability.",
        "Sport": "Narratives about discipline, competition, and personal growth, where victory and defeat reveal character.",
        "Spy": "Stories driven by secrecy, loyalty, and deception, where alliances shift and trust is never simple.",
        "Survival": "Narratives focused on endurance under extreme conditions, testing resilience against nature or circumstance.",
        "Technology": "Stories exploring innovation and its unintended consequences, balancing progress with ethical reflection.",
        "Time Travel": "Narratives bending chronology to explore cause and effect, where altering one moment reshapes everything.",
        "Trauma": "Stories dealing with lasting psychological impact, tracing healing alongside pain and memory.",
        "Underdog": "Narratives celebrating unlikely success against the odds, where persistence challenges expectation.",
        "Violence": "Stories confronting conflict and its consequences, examining harm without ignoring its cost or the lasting scars it leaves.",
        "War": "Narratives focused on conflict, sacrifice, and survival, revealing humanity amid large-scale struggle.",
        "War Crimes": "Stories examining moral boundaries during wartime, confronting accountability and historical reckoning.",
        "Western": "Narratives rooted in frontier justice, isolation, and myth, where landscapes feel as vast as personal codes.",
        "Youth": "Stories centered on energy, uncertainty, and becoming, capturing moments that shape emerging identity."
    },
    "Xanadu": {
        "All": "The whole Xanadu collection of iconic movies across genres, eras and styles, bringing together classics, crowd-pleasers, and hidden gems in one expansive library.",
        "Cast": "Select films featuring beloved actors and actresses known for their memorable performances, spotlighting careers defined by charisma, range, and lasting screen presence.",
        "Director": "Find movies helmed by renowned directors celebrated for their unique styles and storytelling prowess, showcasing distinct creative visions behind the camera.",
        "Genre": "Discover films across various genres, from action-packed adventures to heartfelt dramas, making it easy to match your mood with the right story for any occasion.",
        "Decade": "Movies categorized by the decade of their release, showcasing the evolution of cinema over time and the shifting trends that defined each era with distinctive styles.",
        "Duration": "Organise your time with films of varying lengths, from quick shorts to epic sagas, whether you have an hour to spare or a full evening for immersive storytelling.",
        "Country": "Find films from different countries, highlighting diverse cultures and cinematic traditions, expanding your watchlist beyond familiar borders with global perspectives.",
        "Theme": "Discover films centered on specific themes and narrative elements, connecting stories through shared ideas and emotional threads that reveal deeper meanings and patterns."
    }
}